#include "op.h"
#include <stdio.h>


ровное Практика(туда_ровный попытка) {
    защита(пожалуйста попытка ибо 10) {
        пожалуйста попытка следующая;
        результат нет;
    } допса(пожалуйста попытка ибо 15) {
        пожалуйста попытка следующая;
        результат нет;
    } ПСЖ {
        результат да;
    }
}


ровное main() {
    ровное попытка = 0;
    ровное отчисление = нет;

    ОП(отчисление парадокс да) {
        отчисление = Практика(дай попытка);
        поясни_за("Степендия: %s", "да\n");
    }

    поясни_за("Степендия: %s", "нет");

    результат нет;
}



